[
  {
    "id": 1,
    "name": "Complete Web Development Bootcamp 2025 | HTML, CSS, JavaScript & React",
    "description": "Join the ultimate web development bootcamp and master front-end technologies including HTML5, CSS3, JavaScript ES6, and React. Build responsive websites and real-world projects with certification.",
    "introduction": "The Complete Web Development Bootcamp 2025 is a career-oriented program for aspiring web developers. It covers every essential topic — from core HTML and CSS to advanced JavaScript and React — helping students create visually appealing and functional web applications.",
    "overview": "Throughout this intensive 8-week journey, you will work on hands-on projects, learn responsive design, deploy real websites, and gain the confidence to start freelancing or apply for junior developer positions. Perfect for beginners who want a structured, modern roadmap to full-stack success.",
    "price": 59.99,
    "instructor": "Ayesha Rahman",
    "duration": "8 Weeks",
    "level": "Beginner to Advanced",
    "image": "https://images.pexels.com/photos/1181271/pexels-photo-1181271.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 2,
    "name": "JavaScript Mastery Course | Learn Modern ES6+ & DOM Projects",
    "description": "Learn JavaScript from scratch and advance to building interactive websites using ES6+, asynchronous functions, and API integration. Perfect for web developers aiming to upgrade their coding skills.",
    "introduction": "The JavaScript Mastery Course helps you transition from beginner to confident front-end developer. You’ll master ES6 syntax, DOM manipulation, and asynchronous programming through practical exercises and projects.",
    "overview": "This 6-week course is tailored for developers looking to understand JavaScript deeply. You’ll build multiple mini-projects, integrate APIs, and gain the ability to create dynamic, interactive user interfaces that respond smoothly to real-world interactions.",
    "price": 49.99,
    "instructor": "Nabil Hasan",
    "duration": "6 Weeks",
    "level": "Intermediate",
    "image": "https://images.pexels.com/photos/574071/pexels-photo-574071.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 3,
    "name": "React & Firebase Full-Stack Web App Development",
    "description": "Build professional single-page web apps using React 19 and Firebase. Learn authentication, Firestore database, and hosting — a must-have full-stack skill set for modern web developers.",
    "introduction": "This full-stack course combines the power of React and Firebase to help you build complete web applications from start to finish. You’ll learn to manage state, use hooks, and integrate secure user authentication with Firebase.",
    "overview": "Over 7 weeks, you’ll develop production-level applications, implement Firestore for data storage, and deploy your app using Firebase Hosting. Aimed at intermediate to advanced learners who want to bridge the gap between frontend and backend development.",
    "price": 69.99,
    "instructor": "Ayesha Rahman",
    "duration": "7 Weeks",
    "level": "Intermediate to Advanced",
    "image": "https://images.pexels.com/photos/1181671/pexels-photo-1181671.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 4,
    "name": "Python for Data Science & Analytics | Beginner Certification",
    "description": "Kickstart your data science journey with Python. Learn NumPy, Pandas, and Matplotlib to clean, analyze, and visualize data. Hands-on projects and beginner-friendly content included.",
    "introduction": "The Python for Data Science & Analytics course is perfect for beginners aiming to explore data-driven careers. It covers Python basics and essential data libraries like NumPy, Pandas, and Matplotlib.",
    "overview": "This 6-week course focuses on real-world problem-solving using Python. You’ll clean datasets, visualize trends, and prepare data for deeper analysis or machine learning tasks — ideal for aspiring data analysts or scientists.",
    "price": 54.99,
    "instructor": "Farhana Chowdhury",
    "duration": "6 Weeks",
    "level": "Beginner",
    "image": "https://images.pexels.com/photos/1181359/pexels-photo-1181359.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 5,
    "name": "Machine Learning Course with Python | Hands-On Projects",
    "description": "Master supervised and unsupervised learning with scikit-learn and TensorFlow. This AI-powered course helps you build predictive models and understand neural networks through practical labs.",
    "introduction": "Take your programming skills to the next level with this practical Machine Learning course using Python. You’ll learn to design intelligent systems that predict outcomes based on real-world data.",
    "overview": "Over 8 weeks, explore algorithms like linear regression, decision trees, and neural networks. You’ll build models, evaluate performance, and understand core AI principles using scikit-learn and TensorFlow.",
    "price": 79.99,
    "instructor": "Shahriar Hossain",
    "duration": "8 Weeks",
    "level": "Intermediate",
    "image": "https://images.pexels.com/photos/3861969/pexels-photo-3861969.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 6,
    "name": "UI/UX Design Course with Figma | Learn Prototyping & User Research",
    "description": "Learn user interface and user experience design using Figma. This online UI/UX design course teaches wireframing, color theory, and interactive prototypes to build stunning app interfaces.",
    "introduction": "Unlock your creativity and learn professional UI/UX design with Figma. This beginner course teaches the principles of modern design and usability testing to create user-centered digital experiences.",
    "overview": "In just 5 weeks, you’ll learn how to conduct user research, design wireframes, and prototype interfaces that balance functionality with visual beauty. Ideal for anyone wanting to enter the UX/UI field or enhance front-end design skills.",
    "price": 44.99,
    "instructor": "Farhana Chowdhury",
    "duration": "5 Weeks",
    "level": "Beginner",
    "image": "https://images.pexels.com/photos/3184450/pexels-photo-3184450.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 7,
    "name": "Flutter App Development Bootcamp | Build Android & iOS Apps",
    "description": "Learn Flutter and Dart to create cross-platform mobile apps for Android and iOS. Build real apps with Firebase integration and gain practical experience in mobile app development.",
    "introduction": "The Flutter App Development Bootcamp helps you master the art of mobile app development using Dart and Flutter SDK. Learn to build high-performance, visually stunning apps for both Android and iOS platforms.",
    "overview": "This 7-week bootcamp provides step-by-step training on UI design, state management, and Firebase integration. By the end, you’ll have multiple mobile projects and the confidence to publish apps to the Play Store and App Store.",
    "price": 64.99,
    "instructor": "Rafiul Karim",
    "duration": "7 Weeks",
    "level": "Intermediate",
    "image": "https://images.pexels.com/photos/1181244/pexels-photo-1181244.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 8,
    "name": "Node.js & Express Backend Development | REST API Course",
    "description": "Become a backend developer by mastering Node.js, Express, and MongoDB. Learn how to design REST APIs, handle databases, and deploy production-ready server applications.",
    "introduction": "This backend development course focuses on creating scalable RESTful APIs using Node.js and Express. It’s perfect for front-end developers who want to transition to full-stack development.",
    "overview": "Over 6 weeks, you’ll learn to connect MongoDB databases, manage authentication, and deploy your server using cloud platforms. By the end, you’ll be able to build complete backend systems from scratch.",
    "price": 59.99,
    "instructor": "Nabil Hasan",
    "duration": "6 Weeks",
    "level": "Intermediate",
    "image": "https://images.pexels.com/photos/1181263/pexels-photo-1181263.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 9,
    "name": "Ethical Hacking & Cybersecurity Training | Learn Ethical Hacking Online",
    "description": "Protect systems and networks with this ethical hacking and cybersecurity course. Learn penetration testing, network defense, and real-world hacking techniques safely and legally.",
    "introduction": "This course provides an in-depth understanding of cybersecurity and ethical hacking principles. You’ll learn to identify vulnerabilities, secure systems, and defend networks from cyber threats.",
    "overview": "Over 8 weeks, explore tools and techniques used by ethical hackers to test system security. You’ll learn network scanning, password cracking, and malware analysis in a controlled, legal environment.",
    "price": 74.99,
    "instructor": "Tania Ahmed",
    "duration": "8 Weeks",
    "level": "Advanced",
    "image": "https://images.pexels.com/photos/5380662/pexels-photo-5380662.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 10,
    "name": "MySQL Database Management Course | SQL for Beginners",
    "description": "Learn SQL queries, database design, and relational data management with MySQL. Build efficient databases for web apps and get certified in SQL fundamentals.",
    "introduction": "The MySQL Database Management Course introduces you to SQL — the foundation of all database-driven applications. Learn how to store, manage, and retrieve structured data efficiently.",
    "overview": "This 4-week beginner course teaches relational database design, query optimization, and real-world SQL problem solving. By the end, you’ll be able to create and maintain professional-grade databases.",
    "price": 39.99,
    "instructor": "Nabil Hasan",
    "duration": "4 Weeks",
    "level": "Beginner",
    "image": "https://images.pexels.com/photos/1181298/pexels-photo-1181298.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 11,
    "name": "Adobe Photoshop Essentials | Graphic Design Course for Beginners",
    "description": "Learn photo editing, retouching, and digital compositing using Adobe Photoshop. Start your career in graphic design with this beginner-friendly creative course.",
    "introduction": "This Adobe Photoshop Essentials course helps beginners master image editing and digital art. Learn to work with layers, filters, and professional editing tools for stunning visuals.",
    "overview": "In 3 weeks, you’ll practice retouching, color correction, and compositing to enhance photographs and create creative graphics — ideal for aspiring designers and content creators.",
    "price": 34.99,
    "instructor": "Tania Ahmed",
    "duration": "3 Weeks",
    "level": "Beginner",
    "image": "https://images.pexels.com/photos/4348404/pexels-photo-4348404.jpeg?auto=compress&cs=tinysrgb&w=600"
  },
  {
    "id": 12,
    "name": "Advanced Deep Learning with PyTorch | AI Engineer Course",
    "description": "Train neural networks for image recognition and natural language processing using PyTorch. This AI engineering course helps you master deep learning through GPU-based projects.",
    "introduction": "This advanced AI engineering course is for learners ready to master deep learning using PyTorch. Learn to design, train, and evaluate neural networks for real-world AI challenges.",
    "overview": "Over 10 weeks, you’ll implement CNNs, RNNs, and Transformers, gaining hands-on experience with image recognition, NLP, and GPU-based model training. A perfect course for aspiring AI engineers and researchers.",
    "price": 89.99,
    "instructor": "Shahriar Hossain",
    "duration": "10 Weeks",
    "level": "Advanced",
    "image": "https://images.pexels.com/photos/1181414/pexels-photo-1181414.jpeg?auto=compress&cs=tinysrgb&w=600"
  }
]
